app/Controllers/TaskController.php

SELECT *
FROM `tasks`
---
    public function index()
    {
    $taskModel = new \App\Models\TaskModel();
    $tasks = $taskModel->findAll();